import pytest as pytest

from app.services.utils.normalizer import DataNormalizer


@pytest.mark.parametrize('need_to_normalize, normalized', (
        ({'дата': '10 мая 2024 года'}, {'дата': '10.05.2024'}),
        ({'дата': '4 сентября 2023'}, {'дата': '04.09.2023'}),
        ({'дата': '20.09.2022'}, {'дата': '20.09.2022'}),
        ({'СрокОплаты': 'через 2 дня'}, {'СрокОплаты': '0_0_0_2'}),
        ({'СрокОплаты': 'один год две недели'}, {'СрокОплаты': '1_0_2_0'}),
        ({'СрокОплаты': '5 лет четыре дня'}, {'СрокОплаты': '5_0_0_4'}),
        ({'СрокОплаты': 'через полгода'}, {'СрокОплаты': '0_6_0_0'}),
        ({'СрокОплаты': 'полтора года'}, {'СрокОплаты': '1_6_0_0'}),
        ({'СрокОплаты': 'полтора месяца и 10 дней'}, {'СрокОплаты': '0_1_2_10'}),
        ({'СрокОплаты': 'через 7 недель и 3 дня'}, {'СрокОплаты': '0_0_7_3'}),
        ({'СрокОплаты': 'два года и 15 дней'}, {'СрокОплаты': '2_0_0_15'}),
        ({'СрокОплаты': 'через 2 месяца и 5 дней'}, {'СрокОплаты': '0_2_0_5'}),
        ({'СрокОплаты': 'пять лет'}, {'СрокОплаты': '5_0_0_0'}),
        ({'СрокОплаты': 'один год и полтора месяца'}, {'СрокОплаты': '1_1_2_0'}),
        ({'СрокОплаты': 'семь месяцев и 8 дней'}, {'СрокОплаты': '0_7_0_8'}),
        ({'СрокОплаты': 'четыре года и 20 дней'}, {'СрокОплаты': '4_0_0_20'}),
        ({'СрокОплаты': 'через 1 год и 5 месяцев'}, {'СрокОплаты': '1_5_0_0'}),
        ({'СрокОплаты': 'три недели и 2 дня'}, {'СрокОплаты': '0_0_3_2'}),
))
def test_normalizer(need_to_normalize, normalized):
    result = DataNormalizer.normalize(need_to_normalize)
    assert result == normalized
